In [13]:
import pandas as pd

In [65]:
dict_data={"person": ["luffy" , "Robin" , "san" , "zoro"] , "age" : ["26" , "30" , "32" , "34"] }
dff=pd.DataFrame(dict_data)
dff

  person age
0  luffy  26
1  Robin  30
2    san  32
3   zoro  34

In [57]:
dff.transpose()

                 0     1    2     3
person_name  luffy  nico  san  zoro
people_ages     26    30   32    34

In [66]:
dff

  person age
0  luffy  26
1  Robin  30
2    san  32
3   zoro  34

In [69]:
dff['age']=='luffy'

0    False
1    False
2    False
3    False
Name: age, dtype: bool

In [18]:
dff[dff['age']<'32']

  person age
0  luffy  26
1  Robin  30

In [19]:
dff

  person age
0  luffy  26
1  Robin  30
2    san  32
3   zoro  34

In [62]:
dff.iloc[[0,1] , 1]

0    26
1    30
Name: people_ages, dtype: object

In [64]:
dff.iloc[0:2]

  person_name people_ages
0       luffy          26
1        nico          30

In [73]:
dff.rename(columns={'person':'person_name' , 'age':'people_ages'},inplace=True)
dff

  person_name people_ages
0       luffy          26
1       Robin          30
2         san          32
3        zoro          34

In [29]:
dff.loc[1,'person_name']='nico'
dff

  person_name people_ages
0       luffy          26
1        nico          30
2         san          32
3        zoro          34

In [30]:
dict_data={"animals": ["dragon" , "monkey" , "tiger" , "octopes"] , "age" : ["26" , "30" , "32" , "34"] }
df=pd.DataFrame(dict_data)
df

   animals age
0   dragon  26
1   monkey  30
2    tiger  32
3  octopes  34

In [31]:
two_frames=[dff,df]

In [32]:
two_frames

[  person_name people_ages
 0       luffy          26
 1        nico          30
 2         san          32
 3        zoro          34,
    animals age
 0   dragon  26
 1   monkey  30
 2    tiger  32
 3  octopes  34]

In [33]:
two_frames_set=pd.concat(two_frames)

In [35]:
two_frames_set

  person_name people_ages  animals  age
0       luffy          26      NaN  NaN
1        nico          30      NaN  NaN
2         san          32      NaN  NaN
3        zoro          34      NaN  NaN
0         NaN         NaN   dragon   26
1         NaN         NaN   monkey   30
2         NaN         NaN    tiger   32
3         NaN         NaN  octopes   34

In [37]:
dff

  person_name people_ages
0       luffy          26
1        nico          30
2         san          32
3        zoro          34

In [42]:
dff.groupby(['people_ages'])

In [45]:
dff.groupby(['people_ages']).sum()

            person_name
people_ages
26                luffy
30                 nico
32                  san
34                 zoro

In [48]:
dff.isnull()

   person_name  people_ages
0        False        False
1        False        False
2        False        False
3        False        False

In [49]:
two_frames_set.isnull()

   person_name  people_ages  animals    age
0        False        False     True   True
1        False        False     True   True
2        False        False     True   True
3        False        False     True   True
0         True         True    False  False
1         True         True    False  False
2         True         True    False  False
3         True         True    False  False

In [50]:
dff.notnull()

   person_name  people_ages
0         True         True
1         True         True
2         True         True
3         True         True

In [51]:
two_frames_set.fillna(0)

  person_name people_ages  animals age
0       luffy          26        0   0
1        nico          30        0   0
2         san          32        0   0
3        zoro          34        0   0
0           0           0   dragon  26
1           0           0   monkey  30
2           0           0    tiger  32
3           0           0  octopes  34

In [86]:
two_frames_set

  person_name people_ages  animals  age
0       luffy          26      NaN  NaN
1        nico          30      NaN  NaN
2         san          32      NaN  NaN
3        zoro          34      NaN  NaN
0   No Gender          No   dragon   26
1   No Gender          No   monkey   30
2   No Gender          No    tiger   32
3   No Gender          No  octopes   34